<?php
require './header.php';
?>

    <section class="main">
        <div class="box">
            <h1>Что такое микроразметка</h1>
            <p>Микроразметка — это добавление в существующий HTML-код страницы элементов языка — тегов и атрибутов, которые помогают поисковым ботам распознавать контент и показывать пользователям то, что они ищут. Например, по запросу «рецепт шоколадного печенья», поисковик сразу выдаст список рецептов с фотографиями и необходимой информацией.</p>
            <img src="./image/page1-1.png" alt="" class="img" style="border-radius: 10px;">
            <p class="img-text">Даже бегло просмотрев эти «визитки» сайтов, можно понять, какой рецепт подходит больше</p>
            <p>С помощью микроразметки в анонс страницы или сниппет можно добавить полезную информацию для посетителей сайта:</p>
            <ul>
                <li>изображения;</li>
                <li>рейтинг товаров;</li>
                <li>контактные данные;</li>
                <li>уникальное торговое предложение (УТП);</li>
                <li>разделы сайта;</li>
                <li>категории товаров;</li>
                <li>описание услуг.</li>
            </ul>
            <img src="./image/page1-2.png" alt="" class="img">
            <p class="img-text">Микроразметка для парикмахерской подтягивает в сниппет адрес, часы работы, рейтинг, отзывы и цены: так пользователи сразу получают необходимую информацию</p>
            <p>Если разработчик выполнит все настройки верно, то поисковые системы считают содержимое веб-страницы и сгенерируют визуально приятный сниппет с понятным предложением. Без разметки в поисковике отобразится минимум информации: обычно это URL-адрес сайта и простое однострочное описание. Сколько данных разместить в выдаче — решает специалист.</p>
            <div style="padding-top: 50px;">
                <iframe width="100%" height="450px" src="https://rutube.ru/play/embed/50efe82ae08fa43a7055564e33d1ae6c/" frameBorder="0" allow="clipboard-write; autoplay" webkitAllowFullScreen mozallowfullscreen allowFullScreen></iframe>
            </div>
        </div>        
    </section>

<?php
require './footer.php';
?>