<?php
require './header.php';
?>

    <section class="main">
        <div class="box">
            <h1>Задачи микроразметки</h1>
            <p>Семантическая разметка нужна, чтобы сделать поиск в интернете удобнее. Она помогает специальным программам извлекать и обрабатывать информацию и делать читабельной и понятной для человека.</p>
            <p>Задачи микроразметки отличаются для пользователей и экспертов, которые занимаются продвижением сайтов.</p>
            <div class="cards">
                <div class="card" style="width: 450px;">
                    <div class="card-body">
                        <h5 class="card-title">Для аудитории</h5>
                        <p class="card-text">Возможность сэкономить время и увидеть необходимую информацию сразу, без перехода на сайт. Чаще всего, когда человек ищет простой рецепт шоколадного печенья, он не готов к долгому сёрфингу в интернете: ему важно как можно быстрее выбрать подходящий вариант и начать готовить. Если микроразметка настроена хорошо, уже на первой странице поиска пользователь увидит анонс с фотографией и сможет оценить: нравится ли ему такое печенье, сколько времени понадобится на готовку, нужны ли дополнительные инструменты вроде миксера или форм для выпекания.</p>
                    </div>
                </div>
                <div class="card" style="width: 450px;">
                    <div class="card-body">
                        <h5 class="card-title">Для разработчиков</h5>
                        <p class="card-text">Способ выделить сниппет в поисковой выдаче, сделать его заметным и доступным. Чем чаще пользователи заходят на сайт, тем выше он находится в списке выдачи поисковой системы, соответственно, посещаемость ещё растёт. В итоге такое рутинное действие, как разметка сайта, может со временем повысить узнаваемость бренда и тем самым выполнить задачу по продвижению бизнеса.</p>
                    </div>
                </div>
            </div>
            <img src="./image/page2-1.png" class="img" alt="">
            <p class="img-text">Если микроразметка настроена, сниппеты кулинарных сайтов могут показывать начало рецепта, вести в тематический раздел, фотогалерею и так далее</p>
            <p>Научиться настраивать и проверять микроразметку можно на курсе «Фронтенд-разработчик». На каждом этапе пути студентов поддерживает команда профессиональных ревьюеров, кураторов и наставников — это помогает лучше усвоить материал и подготовиться к работе по новой специальности.</p>
        </div>        
    </section>

<?php
require './footer.php';
?>